## Task-6 Numpy

In [1]:
import pandas as pd
import numpy as np

### 1. Import the NumPy library and create a 2D array data from the given data in the table above.

In [2]:
df=pd.read_csv("E:\Pradeep_Datascience\Github_files\padas_question.csv")

In [3]:
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

In [4]:
array=np.array(df)

In [5]:
array

array([['Alice', 'Female', 25, 165, 58, 'New York'],
       ['Bob', 'Male', 30, 180, 80, 'Los Angeles'],
       ['Charlie', 'Male', 35, 175, 70, 'Chicago'],
       ['Diana', 'Female', 28, 170, 65, 'Miami'],
       ['Eva', 'Female', 27, 175, 60, 'New York'],
       ['Frank', 'Male', 40, 190, 85, 'Houston'],
       ['Grace', 'Female', 32, 168, 55, 'Chicago'],
       ['Henry', 'Male', 45, 175, 75, 'Los Angeles'],
       ['Ivy', 'Female', 26, 172, 63, 'Miami'],
       ['Jack', 'Male', 28, 180, 78, 'New York']], dtype=object)

### 2. Print the shape of the data array.

In [6]:
df.shape

(10, 6)

### 3. Extract the column of heights from the data array and assign it to a new variable heights.

In [7]:
heights=array[:,3]
print(heights)

[165 180 175 170 175 190 168 175 172 180]

### 4. Calculate the mean height of the group using NumPy.

In [8]:
np.mean(heights)

175.0

### 5. Extract the rows of females from the data array and assign it to a new variable females.

In [9]:
females=array[array[:,1]=='Female']
print(females)

[['Alice' 'Female' 25 165 58 'New York']
 ['Diana' 'Female' 28 170 65 'Miami']
 ['Eva' 'Female' 27 175 60 'New York']
 ['Grace' 'Female' 32 168 55 'Chicago']
 ['Ivy' 'Female' 26 172 63 'Miami']]

### 6. Calculate the mean weight of the females in the group using NumPy.

In [12]:
weight=females[:,4]
print(weight)

[58 65 60 55 63]

In [13]:
np.mean(weight)

60.2